apache/nuttx/arch/arm/src/lpc313x/lpc313x_dma.h
/************************************************************************************************
 * arch/arm/src/lpc313x/lpc313x_dma.h
 *
 *   Copyright (C) 2009 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC313X_DMA_H
#define __ARCH_ARM_SRC_LPC313X_DMA_H

/************************************************************************************************
 * Included Files
 ************************************************************************************************/

#include <nuttx/config.h>
#include "lpc313x_memorymap.h"

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/

/* DMA register base address offset into the APB4 domain ****************************************/

#define LPC313X_DMA_VBASE                (LPC313X_APB4_VADDR+LPC313X_APB4_DMA_OFFSET)
#define LPC313X_DMA_PBASE                (LPC313X_APB4_PADDR+LPC313X_APB4_DMA_OFFSET)

/* DMA channel offsets (with respect to the DMA register base address) **************************/

#define LPC313X_DMACHAN_OFFSET(n)        ((n)*0x020)
#define LPC313X_DMACHAN0_OFFSET          0x000
#define LPC313X_DMACHAN1_OFFSET          0x020
#define LPC313X_DMACHAN2_OFFSET          0x040
#define LPC313X_DMACHAN3_OFFSET          0x060
#define LPC313X_DMACHAN4_OFFSET          0x080
#define LPC313X_DMACHAN5_OFFSET          0x0a0
#define LPC313X_DMACHAN6_OFFSET          0x0c0
#define LPC313X_DMACHAN7_OFFSET          0x0e0
#define LPC313X_DMACHAN8_OFFSET          0x100
#define LPC313X_DMACHAN9_OFFSET          0x120
#define LPC313X_DMACHAN10_OFFSET         0x140
#define LPC313X_DMACHAN11_OFFSET         0x160

#define LPC313X_DMACHAN_ALT_OFFSET(n)    (0x200+((n)*0x020))
#define LPC313X_DMACHAN0_ALT_OFFSET      0x200
#define LPC313X_DMACHAN1_ALT_OFFSET      0x220
#define LPC313X_DMACHAN2_ALT_OFFSET      0x240
#define LPC313X_DMACHAN3_ALT_OFFSET      0x260
#define LPC313X_DMACHAN4_ALT_OFFSET      0x280
#define LPC313X_DMACHAN5_ALT_OFFSET      0x2a0
#define LPC313X_DMACHAN6_ALT_OFFSET      0x2c0
#define LPC313X_DMACHAN7_ALT_OFFSET      0x2e0
#define LPC313X_DMACHAN8_ALT_OFFSET      0x300
#define LPC313X_DMACHAN9_ALT_OFFSET      0x320
#define LPC313X_DMACHAN10_ALT_OFFSET     0x340
#define LPC313X_DMACHAN11_ALT_OFFSET     0x360

/* DMA channel virtual base addresses ***********************************************************/

#define LPC313X_DMACHAN_VBASE(n)         (LPC313X_DMA_VBASE+LPC313X_DMACHAN_OFFSET(n))
#define LPC313X_DMACHAN0_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN0_OFFSET)
#define LPC313X_DMACHAN1_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN1_OFFSET)
#define LPC313X_DMACHAN2_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN2_OFFSET)
#define LPC313X_DMACHAN3_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN3_OFFSET)
#define LPC313X_DMACHAN4_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN4_OFFSET)
#define LPC313X_DMACHAN5_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN5_OFFSET)
#define LPC313X_DMACHAN6_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN6_OFFSET)
#define LPC313X_DMACHAN7_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN7_OFFSET)
#define LPC313X_DMACHAN8_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN8_OFFSET)
#define LPC313X_DMACHAN9_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN9_OFFSET)
#define LPC313X_DMACHAN10_VBASE          (LPC313X_DMA_VBASE+LPC313X_DMACHAN10_OFFSET)
#define LPC313X_DMACHAN11_VBASE          (LPC313X_DMA_VBASE+LPC313X_DMACHAN11_OFFSET)

#define LPC313X_DMACHAN_ALT_VBASE(n)     (LPC313X_DMA_VBASE+LPC313X_DMACHAN_ALT_OFFSET(n))
#define LPC313X_DMACHAN0_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN0_ALT_OFFSET)
#define LPC313X_DMACHAN1_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN1_ALT_OFFSET)
#define LPC313X_DMACHAN2_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN2_ALT_OFFSET)
#define LPC313X_DMACHAN3_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN3_ALT_OFFSET)
#define LPC313X_DMACHAN4_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN4_ALT_OFFSET)
#define LPC313X_DMACHAN5_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN5_ALT_OFFSET)
#define LPC313X_DMACHAN6_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN6_ALT_OFFSET)
#define LPC313X_DMACHAN7_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN7_ALT_OFFSET)
#define LPC313X_DMACHAN8_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN8_ALT_OFFSET)
#define LPC313X_DMACHAN9_VBASE           (LPC313X_DMA_VBASE+LPC313X_DMACHAN9_ALT_OFFSET)
#define LPC313X_DMACHAN10_VBASE          (LPC313X_DMA_VBASE+LPC313X_DMACHAN10_ALT_OFFSET)
#define LPC313X_DMACHAN11_VBASE          (LPC313X_DMA_VBASE+LPC313X_DMACHAN11_ALT_OFFSET)

/* DMA channel register offsets (with respect to the DMA channel register base) *****************/

#define LPC313X_DMACHAN_SRCADDR_OFFSET   0x000 /* Source address register of DMA channel */
#define LPC313X_DMACHAN_DESTADDR_OFFSET  0X004 /* Destination address register of DMA channel */
#define LPC313X_DMACHAN_XFERLEN_OFFSET   0X008 /* Transfer length register for DMA channel */
#define LPC313X_DMACHAN_CONFIG_OFFSET    0x00c /* Configuration register for DMA channel */
#define LPC313X_DMACHAN_ENABLE_OFFSET    0x010 /* Enable register for DMA channel */
#define LPC313X_DMACHAN_XFERCOUNT_OFFSET 0x01c /* Transfer counter register for DMA channel */

/* DMA global register offsets (with respect to the DMA register base) *************************/

