apache/nuttx/arch/arm/src/lpc313x/lpc313x_dma.h
#define LPC313X_DMA_ALTENABLE_OFFSET     0x400 /* Alternative enable register */
#define LPC313X_DMA_IRQSTATUSCLR_OFFSET  0x404 /* IRQ status clear register */
#define LPC313X_DMA_IRQMASK_OFFSET       0x408 /* IRQ mask register */
#define LPC313X_DMA_TESTSTATUS_OFFSET    0x40c /* Test FIFO response status register */
#define LPC313X_DMA_SOFTINT_OFFSET       0x410 /* Software interrupt register */

/* DMA channel register (virtual) addresses *****************************************************/

#define LPC313X_DMACHAN_SRCADDR(n)       (LPC313X_DMACHAN_VBASE(n)+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN_DESTADDR(n)      (LPC313X_DMACHAN_VBASE(n)+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN_XFERLEN(n)       (LPC313X_DMACHAN_VBASE(n)+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN_CONFIG(n)        (LPC313X_DMACHAN_VBASE(n)+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN_ENABLE(n)        (LPC313X_DMACHAN_VBASE(n)+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN_XFERCOUNT(n)     (LPC313X_DMACHAN_VBASE(n)+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN0_SRCADDR         (LPC313X_DMACHAN0_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN0_DESTADDR        (LPC313X_DMACHAN0_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN0_XFERLEN         (LPC313X_DMACHAN0_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN0_CONFIG          (LPC313X_DMACHAN0_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN0_ENABLE          (LPC313X_DMACHAN0_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN0_XFERCOUNT       (LPC313X_DMACHAN0_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN1_SRCADDR         (LPC313X_DMACHAN1_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN1_DESTADDR        (LPC313X_DMACHAN1_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN1_XFERLEN         (LPC313X_DMACHAN1_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN1_CONFIG          (LPC313X_DMACHAN1_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN1_ENABLE          (LPC313X_DMACHAN1_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN1_XFERCOUNT       (LPC313X_DMACHAN1_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN2_SRCADDR         (LPC313X_DMACHAN2_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN2_DESTADDR        (LPC313X_DMACHAN2_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN2_XFERLEN         (LPC313X_DMACHAN2_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN2_CONFIG          (LPC313X_DMACHAN2_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN2_ENABLE          (LPC313X_DMACHAN2_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN2_XFERCOUNT       (LPC313X_DMACHAN2_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN3_SRCADDR         (LPC313X_DMACHAN3_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN3_DESTADDR        (LPC313X_DMACHAN3_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN3_XFERLEN         (LPC313X_DMACHAN3_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN3_CONFIG          (LPC313X_DMACHAN3_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN3_ENABLE          (LPC313X_DMACHAN3_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN3_XFERCOUNT       (LPC313X_DMACHAN3_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN4_SRCADDR         (LPC313X_DMACHAN4_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN4_DESTADDR        (LPC313X_DMACHAN4_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN4_XFERLEN         (LPC313X_DMACHAN4_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN4_CONFIG          (LPC313X_DMACHAN4_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN4_ENABLE          (LPC313X_DMACHAN4_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN4_XFERCOUNT       (LPC313X_DMACHAN4_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN5_SRCADDR         (LPC313X_DMACHAN5_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN5_DESTADDR        (LPC313X_DMACHAN5_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN5_XFERLEN         (LPC313X_DMACHAN5_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN5_CONFIG          (LPC313X_DMACHAN5_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN5_ENABLE          (LPC313X_DMACHAN5_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN5_XFERCOUNT       (LPC313X_DMACHAN5_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN6_SRCADDR         (LPC313X_DMACHAN6_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN6_DESTADDR        (LPC313X_DMACHAN6_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN6_XFERLEN         (LPC313X_DMACHAN6_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN6_CONFIG          (LPC313X_DMACHAN6_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN6_ENABLE          (LPC313X_DMACHAN6_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN6_XFERCOUNT       (LPC313X_DMACHAN6_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN7_SRCADDR         (LPC313X_DMACHAN7_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN7_DESTADDR        (LPC313X_DMACHAN7_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN7_XFERLEN         (LPC313X_DMACHAN7_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN7_CONFIG          (LPC313X_DMACHAN7_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN7_ENABLE          (LPC313X_DMACHAN7_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN7_XFERCOUNT       (LPC313X_DMACHAN7_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)7

#define LPC313X_DMACHAN8_SRCADDR         (LPC313X_DMACHAN8_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN8_DESTADDR        (LPC313X_DMACHAN8_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN8_XFERLEN         (LPC313X_DMACHAN8_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN8_CONFIG          (LPC313X_DMACHAN8_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN8_ENABLE          (LPC313X_DMACHAN8_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN8_XFERCOUNT       (LPC313X_DMACHAN8_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN9_SRCADDR         (LPC313X_DMACHAN9_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN9_DESTADDR        (LPC313X_DMACHAN9_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN9_XFERLEN         (LPC313X_DMACHAN9_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN9_CONFIG          (LPC313X_DMACHAN9_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN9_ENABLE          (LPC313X_DMACHAN9_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN9_XFERCOUNT       (LPC313X_DMACHAN9_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

#define LPC313X_DMACHAN10_SRCADDR        (LPC313X_DMACHAN10_VBASE+LPC313X_DMACHAN_SRCADDR_OFFSET)
#define LPC313X_DMACHAN10_DESTADDR       (LPC313X_DMACHAN10_VBASE+LPC313X_DMACHAN_DESTADDR_OFFSET)
#define LPC313X_DMACHAN10_XFERLEN        (LPC313X_DMACHAN10_VBASE+LPC313X_DMACHAN_XFERLEN_OFFSET)
#define LPC313X_DMACHAN10_CONFIG         (LPC313X_DMACHAN10_VBASE+LPC313X_DMACHAN_CONFIG_OFFSET)
#define LPC313X_DMACHAN10_ENABLE         (LPC313X_DMACHAN10_VBASE+LPC313X_DMACHAN_ENABLE_OFFSET)
#define LPC313X_DMACHAN10_XFERCOUNT      (LPC313X_DMACHAN10_VBASE+LPC313X_DMACHAN_XFERCOUNT_OFFSET)

